research/visualization_methods/outputs/Latent Vector Autoregressive Model__LVAR/LVAR.dot
digraph G {
  "AR_sequence" [label="AR_sequence"];
  "GammaShapeRate" [label="GammaShapeRate"];
  "MvNormalMeanScalePrecision" [label="MvNormalMeanScalePrecision"];
  "b" [label="b"];
  "c" [label="c"];
  "c, b" [label="c, b"];
  "dot_sequence" [label="dot_sequence"];
  "form_c_b" [label="form_c_b"];
  "form_priors" [label="form_priors"];
  "i" [label="i"];
  "index" [label="index"];
  "k" [label="k"];
  "length" [label="length"];
  "order" [label="order"];
  "orders" [label="orders"];
  "priors" [label="priors"];
  "x" [label="x"];
  "y" [label="y"];
  "y_length" [label="y_length"];
  "μ" [label="μ"];
  "τ" [label="τ"];
  "AR_sequence" -> "x";
  "GammaShapeRate" -> "τ";
  "MvNormalMeanScalePrecision" -> "y";
  "b" -> "μ";
  "c" -> "μ";
  "dot_sequence" -> "μ";
  "form_c_b" -> "c, b";
  "form_priors" -> "priors";
  "i" -> "y";
  "i" -> "μ";
  "index" -> "x";
  "k" -> "x";
  "k" -> "μ";
  "length" -> "x";
  "length" -> "y_length";
  "order" -> "x";
  "orders" -> "c, b";
  "orders" -> "priors";
  "orders" -> "x";
  "orders" -> "μ";
  "priors" -> "x";
  "x" -> "μ";
  "y" -> "c, b";
  "y" -> "y_length";
  "y_length" -> "x";
  "μ" -> "y";
  "τ" -> "y";
}
